In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002],
    'pop': [1.5, 2.5, 3.0, 2.5, 3.5]
}
df = pd.DataFrame(data, columns=["state", "year", "pop"])
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  2.5
2    Ohio  2002  3.0
3  Nevada  2001  2.5
4  Nevada  2002  3.5

In [8]:
df.pivot("state", "year", "pop",)

year    2000  2001  2002
state
Nevada   NaN   2.5   3.5
Ohio     1.5   2.5   3.0

In [9]:
np.random.seed(0)
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

      data1     data2 key1 key2
0  1.764052 -0.977278    a  one
1  0.400157  0.950088    a  two
2  0.978738 -0.151357    b  one
3  2.240893 -0.103219    b  two
4  1.867558  0.410599    a  one

In [11]:
df.groupby(df.key1).max()

         data1     data2 key2
key1
a     1.867558  0.950088  two
b     2.240893 -0.103219  two

In [15]:
df.loc[df.key1=="a" , :]

      data1     data2 key1 key2
0  1.764052 -0.977278    a  one
1  0.400157  0.950088    a  two
4  1.867558  0.410599    a  one

In [24]:
df.data1.groupby(df.key1).max()

key1
a    1.867558
b    2.240893
Name: data1, dtype: float64

In [25]:
type(df.data1.groupby(df.key1).max())

pandas.core.series.Series

In [29]:
df.groupby(df.key1).max()

         data1     data2 key2
key1
a     1.867558  0.950088  two
b     2.240893 -0.103219  two

In [30]:
type(df.groupby(df.key1).max())

pandas.core.frame.DataFrame

In [31]:
df.groupby(df.key1).max()["data1"]

key1
a    1.867558
b    2.240893
Name: data1, dtype: float64

In [32]:
df

      data1     data2 key1 key2
0  1.764052 -0.977278    a  one
1  0.400157  0.950088    a  two
2  0.978738 -0.151357    b  one
3  2.240893 -0.103219    b  two
4  1.867558  0.410599    a  one

In [34]:
df.pivot_table("data2","key1", "key2")

key2       one       two
key1
a    -0.283340  0.950088
b    -0.151357 -0.103219

In [35]:
import seaborn as sns

tips = sns.load_dataset("tips")
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [37]:
#식사대금과 팁의 비율 tips["tip_pct]
tips["tip_pct"] = tips["tip"]/ tips["total_bill"]
tips.tail()

     total_bill   tip     sex smoker   day    time  size   tip_pct
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

In [38]:
tips.describe()

       total_bill         tip        size     tip_pct
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672    0.160803
std      8.902412    1.383638    0.951100    0.061072
min      3.070000    1.000000    1.000000    0.035638
25%     13.347500    2.000000    2.000000    0.129127
50%     17.795000    2.900000    2.000000    0.154770
75%     24.127500    3.562500    3.000000    0.191475
max     50.810000   10.000000    6.000000    0.710345

In [39]:
tips.groupby("sex").count()

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [40]:
tips.groupby(["sex", "smoker"]).size()

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
dtype: int64

In [42]:
tips.pivot_table("tip_pct", "sex", "smoker")

smoker       Yes        No
sex
Male    0.152771  0.160669
Female  0.182150  0.156921